<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>local.munki.AutoPkgr</string>
    <key>Input</key>
    <dict>
        <key>DISPLAY_NAME</key>
        <string>AutoPkgr</string>
        <key>LANGUAGE</key>
        <string>en-US</string>
        <key>LOCALE</key>
        <string>en-US</string>
        <key>MUNKI_CATEGORY</key>
        <string>Administration</string>
        <key>MUNKI_DESCRIPTION</key>
        <string>AutoPkgr is a free Mac app that makes it easy to install and configure AutoPkg.</string>
        <key>MUNKI_DEVELOPER</key>
        <string>Linde Group, Inc.</string>
        <key>MUNKI_ICON</key>
        <string></string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>%NAME%</string>
        <key>NAME</key>
        <string>AutoPkgr</string>
        <key>SPARKLE_FEED_URL</key>
        <string>https://raw.githubusercontent.com/lindegroup/autopkgr/appcast/appcast.xml</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>test</string>
                <string>autopkg</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>%MUNKI_DESCRIPTION%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.homebysix.munki.AutoPkgr</string>
    <key>ParentRecipeTrustInfo</key>
    <dict>
        <key>non_core_processors</key>
        <dict/>
        <key>parent_recipes</key>
        <dict>
            <key>com.github.homebysix.download.AutoPkgr</key>
            <dict>
                <key>git_hash</key>
                <string>787a03800bafbca3dc640b6f41ff1ea62338a065</string>
                <key>path</key>
                <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/AutoPkgr/AutoPkgr.download.recipe</string>
                <key>sha256_hash</key>
                <string>8f3d34e364953e9a4bf091110761be5d658007075f62e4f05178464169521831</string>
            </dict>
            <key>com.github.homebysix.munki.AutoPkgr</key>
            <dict>
                <key>git_hash</key>
                <string>787a03800bafbca3dc640b6f41ff1ea62338a065</string>
                <key>path</key>
                <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/AutoPkgr/AutoPkgr.munki.recipe</string>
                <key>sha256_hash</key>
                <string>e99a12cfa730f0223db312208c2b74f111b21cbefdcecb12a88cf9e1c99ea4ae</string>
            </dict>
        </dict>
    </dict>
</dict>
</plist>
