<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Identifier</key>
        <string>local.munki.AdobeFlashPlayer</string>
        <key>Input</key>
        <dict>
            <key>DISPLAY_NAME</key>
            <string>Adobe Flash Player</string>
            <key>LANGUAGE</key>
            <string>en-US</string>
            <key>LOCALE</key>
            <string>en-US</string>
            <key>MAKEPKGINFO_PKGNAME</key>
            <string>Install Adobe Flash Player.app/Contents/Resources/Adobe Flash Player.pkg</string>
            <key>MUNKI_CATEGORY</key>
            <string>Utilities</string>
            <key>MUNKI_DESCRIPTION</key>
            <string>Adobe Flash Player is a cross-platform browser-based application runtime that delivers uncompromised viewing of expressive applications, content, and videos across screens and browsers.</string>
            <key>MUNKI_DEVELOPER</key>
            <string>Adobe</string>
            <key>MUNKI_ICON</key>
            <string></string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>%NAME%</string>
            <key>NAME</key>
            <string>AdobeFlashPlayer</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>test</string>
                    <string>autopkg</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>%MUNKI_DESCRIPTION%</string>
                <key>developer</key>
                <string>%MUNKI_DEVELOPER%</string>
                <key>display_name</key>
                <string>%DISPLAY_NAME%</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true />
                <key>unattended_uninstall</key>
                <true />
            </dict>
        </dict>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.munki.FlashPlayerNoRepackage</string>
        <key>ParentRecipeTrustInfo</key>
        <dict>
            <key>non_core_processors</key>
            <dict>
                <key>AdobeFlashURLProvider</key>
                <dict>
                    <key>git_hash</key>
                    <string>8574c91661dc067f31a486239fd8f5685c6f4fa0</string>
                    <key>path</key>
                    <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/AdobeFlashPlayer/AdobeFlashURLProvider.py</string>
                    <key>sha256_hash</key>
                    <string>b9b30ed09e83972dc49753c190a06b618a7fc9aaee7493f5c1d8b70fc33020ed</string>
                </dict>
            </dict>
            <key>parent_recipes</key>
            <dict>
                <key>com.github.autopkg.download.FlashPlayer</key>
                <dict>
                    <key>git_hash</key>
                    <string>c0df9f32f5b2402fb3460d8b631092c242ac358a</string>
                    <key>path</key>
                    <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/AdobeFlashPlayer/AdobeFlashPlayer.download.recipe</string>
                    <key>sha256_hash</key>
                    <string>be6eb2bda8a85e76e8fc70d511d0fd3e65aaf26d5f52245661489004af231388</string>
                </dict>
                <key>com.github.autopkg.munki.FlashPlayerNoRepackage</key>
                <dict>
                    <key>git_hash</key>
                    <string>8cf2b8a33887e46bd0a95c463881d3d0b6ef96b2</string>
                    <key>path</key>
                    <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/AdobeFlashPlayer/AdobeFlashPlayer.munki.recipe</string>
                    <key>sha256_hash</key>
                    <string>2d9c62120dd57503be1d3a3b8e49f6baa7ecf79ae6298c843769b7c35058f598</string>
                </dict>
            </dict>
        </dict>
    </dict>
</plist>
