<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Identifier</key>
        <string>local.munki.iTerm2</string>
        <key>Input</key>
        <dict>
            <key>DISPLAY_NAME</key>
            <string>iTerm2</string>
            <key>LANGUAGE</key>
            <string>en-US</string>
            <key>LOCALE</key>
            <string>en-US</string>
            <key>MUNKI_CATEGORY</key>
            <string>Development</string>
            <key>MUNKI_DESCRIPTION</key>
            <string>iTerm2 is a replacement for Terminal and the successor to iTerm. It works on Macs with OS 10.5 (Leopard) or newer. Its focus is on performance, internationalization, and supporting innovative features that make your life better.</string>
            <key>MUNKI_DEVELOPER</key>
            <string>George Nachman</string>
            <key>MUNKI_ICON</key>
            <string></string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>%NAME%</string>
            <key>NAME</key>
            <string>iTerm2</string>
            <key>RELEASE</key>
            <string>final</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>test</string>
                    <string>autopkg</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>%MUNKI_DESCRIPTION%</string>
                <key>developer</key>
                <string>%MUNKI_DEVELOPER%</string>
                <key>display_name</key>
                <string>%DISPLAY_NAME%</string>
                <key>minimum_os_version</key>
                <string>10.5</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true />
                <key>unattended_uninstall</key>
                <true />
            </dict>
        </dict>
        <key>ParentRecipe</key>
        <string>io.github.hjuutilainen.munki.iTerm2</string>
        <key>ParentRecipeTrustInfo</key>
        <dict>
            <key>non_core_processors</key>
            <dict />
            <key>parent_recipes</key>
            <dict>
                <key>io.github.hjuutilainen.download.iTerm2</key>
                <dict>
                    <key>git_hash</key>
                    <string>89bba55431c07e37bb498cc476ba2366dcf52469</string>
                    <key>path</key>
                    <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.hjuutilainen-recipes/iTerm2/iTerm2.download.recipe</string>
                    <key>sha256_hash</key>
                    <string>8ddb1e9e9c14fc9bd19e997250942f7ae67b94702171ed35e69c6bcffe6a07a5</string>
                </dict>
                <key>io.github.hjuutilainen.munki.iTerm2</key>
                <dict>
                    <key>git_hash</key>
                    <string>b19087c24635b28b78ca85bc353990b9f2381d09</string>
                    <key>path</key>
                    <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.hjuutilainen-recipes/iTerm2/iTerm2.munki.recipe</string>
                    <key>sha256_hash</key>
                    <string>1292b005c584d33e67e22d55905e803311cdec5299297b5f4bbf0c462186e0f4</string>
                </dict>
            </dict>
        </dict>
    </dict>
</plist>