<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Identifier</key>
        <string>local.munki.VisualStudioCode</string>
        <key>Input</key>
        <dict>
            <key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
            <false/>
            <key>DISPLAY_NAME</key>
            <string>Visual Studio Code</string>
            <key>DOWNLOAD_URL</key>
            <string>https://go.microsoft.com/fwlink/?LinkID=620882</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>%NAME%</string>
            <key>MUNKI_CATEGORY</key>
            <string>Development</string>
            <key>MUNKI_DESCRIPTION</key>
            <string>Code combines the streamlined UI of a modern editor with rich code assistance and navigation, and an integrated debugging experience – without the need for a full IDE.</string>
            <key>MUNKI_DEVELOPER</key>
            <string>Microsoft</string>
            <key>MUNKI_ICON</key>
            <string></string>
            <key>NAME</key>
            <string>VisualStudioCode</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>test</string>
                    <string>autopkg</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>%MUNKI_DESCRIPTION%</string>
                <key>developer</key>
                <string>%MUNKI_DEVELOPER%</string>
                <key>display_name</key>
                <string>%DISPLAY_NAME%</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
                <key>unattended_uninstall</key>
                <true/>
            </dict>
        </dict>
        <key>ParentRecipe</key>
        <string>com.github.killahquam.munki.visualstudiocode</string>
        <key>ParentRecipeTrustInfo</key>
        <dict>
            <key>non_core_processors</key>
            <dict/>
            <key>parent_recipes</key>
            <dict>
                <key>com.github.killahquam.download.visualstudiocode</key>
                <dict>
                    <key>git_hash</key>
                    <string>b7ff3eada65cc9deea330bb53d697d3b8c406f5b</string>
                    <key>path</key>
                    <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.killahquam-recipes/VisualStudioCode/VisualStudioCode.download.recipe</string>
                    <key>sha256_hash</key>
                    <string>1cb8d4296e4e70c39ed8dc3461c2b17761a38a5ce0ba8e932c7b4ee05fccb844</string>
                </dict>
                <key>com.github.killahquam.munki.visualstudiocode</key>
                <dict>
                    <key>git_hash</key>
                    <string>b8639ace132f1d2893b898744c144ede800e953a</string>
                    <key>path</key>
                    <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.killahquam-recipes/VisualStudioCode/VisualStudioCode.munki.recipe</string>
                    <key>sha256_hash</key>
                    <string>8069536b3fca30dd289ee85c3b62c74aa62cd9178493ae7c8b804195b64bbcea</string>
                </dict>
            </dict>
        </dict>
    </dict>
</plist>
