<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Identifier</key>
        <string>local.munki.AdobeReaderDC</string>
        <key>Input</key>
        <dict>
            <key>DISPLAY_NAME</key>
            <string>Adobe Acrobat Reader DC</string>
            <key>LANGUAGE</key>
            <string>English</string>
            <key>LOCALE</key>
            <string>en-US</string>
            <key>MUNKI_CATEGORY</key>
            <string>Office</string>
            <key>MUNKI_DESCRIPTION</key>
            <string>More powerful than other PDF software, Adobe Acrobat Reader DC is the free, trusted standard for viewing, printing, and annotating PDFs. And now, it's connected to Adobe Document Cloud so it's easier than ever to work with PDFs on computers
                and mobile devices.</string>
            <key>MUNKI_DEVELOPER</key>
            <string>Adobe</string>
            <key>MUNKI_ICON</key>
            <string></string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>%NAME%</string>
            <key>NAME</key>
            <string>AdobeReaderDC</string>
            <key>major_version</key>
            <string>AcrobatDC</string>
            <key>os_version</key>
            <string>10.12.0</string>
            <key>pkginfo</key>
            <dict>
                <key>blocking_applications</key>
                <array>
                    <string>Adobe Reader.app</string>
                    <string>Adobe Acrobat Reader DC.app</string>
                    <string>Adobe Acrobat Pro.app</string>
                </array>
                <key>catalogs</key>
                <array>
                    <string>test</string>
                    <string>autopkg</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>%MUNKI_DESCRIPTION%</string>
                <key>developer</key>
                <string>%MUNKI_DEVELOPER%</string>
                <key>display_name</key>
                <string>%DISPLAY_NAME%</string>
                <key>minimum_os_version</key>
                <string>10.12.0</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>preinstall_script</key>
                <string>#!/bin/sh if [ -e "/Applications/Adobe Acrobat Reader DC.app" ]; then rm -r "/Applications/Adobe Acrobat Reader DC.app" fi exit 0
                </string>
                <key>unattended_install</key>
                <true/>
                <key>unattended_uninstall</key>
                <true/>
            </dict>
        </dict>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.munki.AdobeReaderDC</string>
        <key>ParentRecipeTrustInfo</key>
        <dict>
            <key>non_core_processors</key>
            <dict>
                <key>AdobeReaderURLProvider</key>
                <dict>
                    <key>git_hash</key>
                    <string>437e573e281a4bd4ceb40ee569fc3e3dd441d0ba</string>
                    <key>path</key>
                    <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/AdobeReader/AdobeReaderURLProvider.py</string>
                    <key>sha256_hash</key>
                    <string>c2fa5d078493c52e8fe34e8f899ed0590421fffa2d0bbe91a1b6b4f07bbe4498</string>
                </dict>
            </dict>
            <key>parent_recipes</key>
            <dict>
                <key>com.github.autopkg.download.AdobeReaderDC</key>
                <dict>
                    <key>git_hash</key>
                    <string>55e47128864841e568cf20ccd2b852fea48faa50</string>
                    <key>path</key>
                    <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/AdobeReader/AdobeReaderDC.download.recipe</string>
                    <key>sha256_hash</key>
                    <string>755139a0e0479cd7ae56771ca60ee443562f0f5636f46de05a03a68be07b3daa</string>
                </dict>
                <key>com.github.autopkg.munki.AdobeReaderDC</key>
                <dict>
                    <key>git_hash</key>
                    <string>e6099c55261ae5bc78f773f9c417c280b3657f34</string>
                    <key>path</key>
                    <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/AdobeReader/AdobeReaderDC.munki.recipe</string>
                    <key>sha256_hash</key>
                    <string>e57974268d396c884ba267a06143cbf0586760754cb6456a640d76fb97faf196</string>
                </dict>
            </dict>
        </dict>
    </dict>
</plist>
