<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Identifier</key>
        <string>local.munki.Wireshark</string>
        <key>Input</key>
        <dict>
            <key>DISPLAY_NAME</key>
            <string>Wireshark</string>
            <key>LANGUAGE</key>
            <string>en-US</string>
            <key>LOCALE</key>
            <string>en-US</string>
            <key>MUNKI_CATEGORY</key>
            <string>Development</string>
            <key>MUNKI_DESCRIPTION</key>
            <string>Wireshark is a network protocol analyzer.</string>
            <key>MUNKI_DEVELOPER</key>
            <string>The Wireshark Team</string>
            <key>MUNKI_ICON</key>
            <string></string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>%NAME%</string>
            <key>NAME</key>
            <string>Wireshark</string>
            <key>pkginfo</key>
            <dict>
                <key>blocking_applications</key>
                <array>
                    <string>Wireshark</string>
                </array>
                <key>catalogs</key>
                <array>
                    <string>test</string>
                    <string>autopkg</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>%MUNKI_DESCRIPTION%</string>
                <key>developer</key>
                <string>%MUNKI_DEVELOPER%</string>
                <key>display_name</key>
                <string>%DISPLAY_NAME%</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true />
                <key>unattended_uninstall</key>
                <true />
            </dict>
        </dict>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.cgerke-recipes.munki.Wireshark</string>
        <key>ParentRecipeTrustInfo</key>
        <dict>
            <key>non_core_processors</key>
            <dict />
            <key>parent_recipes</key>
            <dict>
                <key>com.github.autopkg.cgerke-recipes.download.Wireshark</key>
                <dict>
                    <key>git_hash</key>
                    <string>60ead6b73c28bcf5b1916059a65bb64cc9593238</string>
                    <key>path</key>
                    <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.cgerke-recipes/Applications/Wireshark.download.recipe</string>
                    <key>sha256_hash</key>
                    <string>5ea0cdfb652b267dd13009b2b0b81a650bbdf926b931e6bbb9317dd0be12682c</string>
                </dict>
                <key>com.github.autopkg.cgerke-recipes.munki.Wireshark</key>
                <dict>
                    <key>git_hash</key>
                    <string>60ead6b73c28bcf5b1916059a65bb64cc9593238</string>
                    <key>path</key>
                    <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.cgerke-recipes/Applications/Wireshark.munki.recipe</string>
                    <key>sha256_hash</key>
                    <string>4334b053114c67115ecc56e84ffde7536e3d3dfba83ae35d025ebee55657140e</string>
                </dict>
            </dict>
        </dict>
    </dict>
</plist>