<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Identifier</key>
        <string>local.munki.MicrosoftOneNote</string>
        <key>Input</key>
        <dict>
            <key>DISPLAY_NAME</key>
            <string>Microsoft OneNote</string>
            <key>LANGUAGE</key>
            <string>en-US</string>
            <key>LOCALE</key>
            <string>en-US</string>
            <key>MUNKI_CATEGORY</key>
            <string>Office</string>
            <key>MUNKI_DESCRIPTION</key>
            <string>OneNote is a Microsoft Office app similar to Evernote or Dropbox Paper, for taking notes and storing information. OneNote lets you create notebooks for different topics, with each notebook featuring any number of sections and unlimited pages.</string>
            <key>MUNKI_DEVELOPER</key>
            <string>Microsoft</string>
            <key>MUNKI_ICON</key>
            <string></string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>%NAME%</string>
            <key>NAME</key>
            <string>MicrosoftOneNote</string>
            <key>downloadurl</key>
            <string>https://go.microsoft.com/fwlink/?linkid=%PRODUCTID%</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>test</string>
                    <string>autopkg</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>%MUNKI_DESCRIPTION%</string>
                <key>developer</key>
                <string>%MUNKI_DEVELOPER%</string>
                <key>display_name</key>
                <string>%DISPLAY_NAME%</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true />
                <key>unattended_uninstall</key>
                <true />
            </dict>
            <key>productid</key>
            <string>820886</string>
            <key>softwaretitle</key>
            <string>OneNote</string>
            <key>vendor</key>
            <string>Microsoft</string>
        </dict>
        <key>ParentRecipe</key>
        <string>com.github.rtrouton.munki.microsoftonenote365</string>
        <key>ParentRecipeTrustInfo</key>
        <dict>
            <key>non_core_processors</key>
            <dict />
            <key>parent_recipes</key>
            <dict>
                <key>com.github.rtrouton.download.microsoftonenote365</key>
                <dict>
                    <key>git_hash</key>
                    <string>8a29db2944790f4a29cc98618e0d2e87c96668d5</string>
                    <key>path</key>
                    <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/MicrosoftOneNote365/MicrosoftOneNote365.download.recipe</string>
                    <key>sha256_hash</key>
                    <string>a60cad6107c758ea36cda01540115384839dcffd3bc65189c37ae09bbf820357</string>
                </dict>
                <key>com.github.rtrouton.munki.microsoftonenote365</key>
                <dict>
                    <key>git_hash</key>
                    <string>501275f9e371078f0b0a414cfda1d237a3ea182e</string>
                    <key>path</key>
                    <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/MicrosoftOneNote365/MicrosoftOneNote365.munki.recipe</string>
                    <key>sha256_hash</key>
                    <string>702a143f4609bfe2f9abf9d4e94439a73ac10fd4f3cac44aa3388f302744fa2f</string>
                </dict>
            </dict>
        </dict>
    </dict>
</plist>