<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Identifier</key>
        <string>local.munki.MicrosoftTeams</string>
        <key>Input</key>
        <dict>
            <key>DISPLAY_NAME</key>
            <string>Microsoft Teams</string>
            <key>LANGUAGE</key>
            <string>en-US</string>
            <key>LOCALE</key>
            <string>en-US</string>
            <key>MUNKI_CATEGORY</key>
            <string>Communications</string>
            <key>MUNKI_DESCRIPTION</key>
            <string>Microsoft Teams is a cloud-based team collaboration software, that is part of the Office 365 suite of applications. The core capabilities in Microsoft Teams include business messaging, calling, video meetings and file sharing.</string>
            <key>MUNKI_DEVELOPER</key>
            <string>Microsoft</string>
            <key>MUNKI_ICON</key>
            <string></string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>%NAME%</string>
            <key>NAME</key>
            <string>MicrosoftTeams</string>
            <key>downloadurl</key>
            <string>https://go.microsoft.com/fwlink/?linkid=%PRODUCTID%</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>test</string>
                    <string>autopkg</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>%MUNKI_DESCRIPTION%</string>
                <key>developer</key>
                <string>%MUNKI_DEVELOPER%</string>
                <key>display_name</key>
                <string>%DISPLAY_NAME%</string>
                <key>minimum_os_version</key>
                <string>10.10.0</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true />
                <key>unattended_uninstall</key>
                <true />
            </dict>
            <key>productid</key>
            <string>869428</string>
            <key>softwaretitle</key>
            <string>Teams</string>
            <key>vendor</key>
            <string>Microsoft</string>
        </dict>
        <key>ParentRecipe</key>
        <string>com.github.rtrouton.munki.microsoftteams</string>
        <key>ParentRecipeTrustInfo</key>
        <dict>
            <key>non_core_processors</key>
            <dict />
            <key>parent_recipes</key>
            <dict>
                <key>com.github.rtrouton.download.microsoftteams</key>
                <dict>
                    <key>git_hash</key>
                    <string>ccb1573111f263e913f8e4b81e1c1b5f2785abb7</string>
                    <key>path</key>
                    <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/MicrosoftTeams/MicrosoftTeams.download.recipe</string>
                    <key>sha256_hash</key>
                    <string>bab53e18aec97d83639884ada7e4cf72dc3f1a67ad75c171d0a658dbe27d9f2b</string>
                </dict>
                <key>com.github.rtrouton.munki.microsoftteams</key>
                <dict>
                    <key>git_hash</key>
                    <string>51fcaa5a39e616cbc238e29ff683e9ecee3cf247</string>
                    <key>path</key>
                    <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/MicrosoftTeams/MicrosoftTeams.munki.recipe</string>
                    <key>sha256_hash</key>
                    <string>d822fcd4b45322ed0c434adea62621d4b838b518e16972745730cc2fa7b451e2</string>
                </dict>
            </dict>
        </dict>
    </dict>
</plist>