<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Identifier</key>
        <string>local.munki.GoogleChrome</string>
        <key>Input</key>
        <dict>
            <key>DISPLAY_NAME</key>
            <string>Google Chrome</string>
            <key>DOWNLOAD_URL</key>
            <string>https://dl.google.com/chrome/mac/stable/GGRO/googlechrome.dmg</string>
            <key>LANGUAGE</key>
            <string>en-US</string>
            <key>LOCALE</key>
            <string>en-US</string>
            <key>MUNKI_CATEGORY</key>
            <string>Web Browsers</string>
            <key>MUNKI_DESCRIPTION</key>
            <string>Chrome is a fast, simple, and secure web browser, built for the modern web.</string>
            <key>MUNKI_DEVELOPER</key>
            <string>Google</string>
            <key>MUNKI_ICON</key>
            <string></string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>%NAME%</string>
            <key>NAME</key>
            <string>GoogleChrome</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>test</string>
                    <string>autopkg</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>%MUNKI_DESCRIPTION%</string>
                <key>developer</key>
                <string>%MUNKI_DEVELOPER%</string>
                <key>display_name</key>
                <string>%DISPLAY_NAME%</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true />
                <key>unattended_uninstall</key>
                <true />
            </dict>
        </dict>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.munki.google-chrome</string>
        <key>ParentRecipeTrustInfo</key>
        <dict>
            <key>non_core_processors</key>
            <dict />
            <key>parent_recipes</key>
            <dict>
                <key>com.github.autopkg.download.googlechrome</key>
                <dict>
                    <key>git_hash</key>
                    <string>1d8ed0662d02653b32d0c34f041df521a1c551aa</string>
                    <key>path</key>
                    <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.download.recipe</string>
                    <key>sha256_hash</key>
                    <string>f5313754f89bbff7c7d71dd99fa5151b67ff75cf21a00b0ce215c415b0c09549</string>
                </dict>
                <key>com.github.autopkg.munki.google-chrome</key>
                <dict>
                    <key>git_hash</key>
                    <string>5f5db38265797f1754def56335de7bfc75811305</string>
                    <key>path</key>
                    <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.munki.recipe</string>
                    <key>sha256_hash</key>
                    <string>8fd2feaa1c196109ee3bc4149b2447936782336f913c39875a4ad6c3e6dc4baa</string>
                </dict>
            </dict>
        </dict>
    </dict>
</plist>