<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>local.munki.filebeat</string>
    <key>Input</key>
    <dict>
        <key>DISPLAY_NAME</key>
        <string>Filebeat</string>
        <key>LANGUAGE</key>
        <string>en-US</string>
        <key>LOCALE</key>
        <string>en-US</string>
        <key>MUNKI_CATEGORY</key>
        <string>Utilities</string>
        <key>MUNKI_DESCRIPTION</key>
        <string>Filebeat is a lightweight, open source shipper for log file data. As the next-generation Logstash Forwarder, Filebeat tails logs and quickly sends this information to Logstash for further parsing and enrichment or to Elasticsearch for centralized storage and analysis.</string>
        <key>MUNKI_DEVELOPER</key>
        <string>Elasticsearch</string>
        <key>MUNKI_ICON</key>
        <string></string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>%NAME%</string>
        <key>NAME</key>
        <string>filebeat</string>
        <key>beat_name</key>
        <string>filebeat</string>
        <key>optional_version</key>
        <string></string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>test</string>
                <string>autopkg</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>%MUNKI_DESCRIPTION%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>io.github.hjuutilainen.munki.filebeat</string>
    <key>ParentRecipeTrustInfo</key>
    <dict>
        <key>non_core_processors</key>
        <dict>
            <key>io.github.hjuutilainen.SharedProcessors/ChecksumVerifier</key>
            <dict>
                <key>git_hash</key>
                <string>84e2884cfac7aaed5d34ac55ff8a7b97f2784741</string>
                <key>path</key>
                <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.hjuutilainen-recipes/SharedProcessors/ChecksumVerifier.py</string>
                <key>sha256_hash</key>
                <string>3d79f4dd0e30d616daf0a4f0376b219243280592d943298899594850f6f9fe64</string>
            </dict>
        </dict>
        <key>parent_recipes</key>
        <dict>
            <key>io.github.hjuutilainen.download.elasticbeat</key>
            <dict>
                <key>git_hash</key>
                <string>efff88917196acfacdd356f26a21edbae7a02778</string>
                <key>path</key>
                <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.hjuutilainen-recipes/Elasticsearch/elasticbeat.download.recipe</string>
                <key>sha256_hash</key>
                <string>4a855ef29a84f5371d34f176aa3fd1a33f6635f0b41eb8e98a9850fa5292b2fd</string>
            </dict>
            <key>io.github.hjuutilainen.munki.filebeat</key>
            <dict>
                <key>git_hash</key>
                <string>ae1c7873a6e441ddfb0eb5f5f78cdce02549fcc2</string>
                <key>path</key>
                <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.hjuutilainen-recipes/Elasticsearch/filebeat.munki.recipe</string>
                <key>sha256_hash</key>
                <string>ed03d0202b652214add8dd1e8826b5701f9a014223f29602d1606fd0cf911010</string>
            </dict>
            <key>io.github.hjuutilainen.pkg.elasticbeat</key>
            <dict>
                <key>git_hash</key>
                <string>8ba3daf3c5b3c5f138fd30b89b54a1d3511d2c26</string>
                <key>path</key>
                <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.hjuutilainen-recipes/Elasticsearch/elasticbeat.pkg.recipe</string>
                <key>sha256_hash</key>
                <string>bd6d7313b91fda7cc06d97513295ffcc6e4096ff9141a665d1978cb8b036cf2d</string>
            </dict>
            <key>io.github.hjuutilainen.pkg.filebeat</key>
            <dict>
                <key>git_hash</key>
                <string>ae1c7873a6e441ddfb0eb5f5f78cdce02549fcc2</string>
                <key>path</key>
                <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.hjuutilainen-recipes/Elasticsearch/filebeat.pkg.recipe</string>
                <key>sha256_hash</key>
                <string>19af80c7192d12f7fee7601df1aa9609ec682569e32d3c7eadcd8375f83d8034</string>
            </dict>
        </dict>
    </dict>
</dict>
</plist>
