<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Identifier</key>
        <string>local.munki.1Password</string>
        <key>Input</key>
        <dict>
            <key>DISPLAY_NAME</key>
            <string>1Password</string>
            <key>LANGUAGE</key>
            <string>en-US</string>
            <key>LOCALE</key>
            <string>en-US</string>
            <key>MUNKI_CATEGORY</key>
            <string>Security</string>
            <key>MUNKI_DESCRIPTION</key>
            <string>1Password is a password manager that goes beyond simple password storage by integrating directly with your web browser to automatically log you into websites, enter credit card information, fill registration forms, and easily generate strong passwords.</string>
            <key>MUNKI_DEVELOPER</key>
            <string>AgileBits Inc.</string>
            <key>MUNKI_ICON</key>
            <string></string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>%NAME%</string>
            <key>NAME</key>
            <string>1Password</string>
            <key>pkginfo</key>
            <dict>
                <key>blocking_applications</key>
                <array>
                    <string>1Password 7</string>
                </array>
                <key>catalogs</key>
                <array>
                    <string>test</string>
                    <string>autopkg</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>%MUNKI_DESCRIPTION%</string>
                <key>developer</key>
                <string>%MUNKI_DEVELOPER%</string>
                <key>display_name</key>
                <string>%DISPLAY_NAME%</string>
                <key>minimum_os_version</key>
                <string>10.12</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true />
                <key>unattended_uninstall</key>
                <true />
            </dict>
        </dict>
        <key>ParentRecipe</key>
        <string>io.github.hjuutilainen.munki.1Password</string>
        <key>ParentRecipeTrustInfo</key>
        <dict>
            <key>non_core_processors</key>
            <dict />
            <key>parent_recipes</key>
            <dict>
                <key>io.github.hjuutilainen.download.1Password</key>
                <dict>
                    <key>git_hash</key>
                    <string>dfc3143e9230d6d31c5707202b870d93ca1b6c8c</string>
                    <key>path</key>
                    <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.hjuutilainen-recipes/AgileBits/1Password.download.recipe</string>
                    <key>sha256_hash</key>
                    <string>7941aab20fdb6a545c6db43e264aab424c6f30d2dd934b359c7ba8ed392d110a</string>
                </dict>
                <key>io.github.hjuutilainen.munki.1Password</key>
                <dict>
                    <key>git_hash</key>
                    <string>dfc3143e9230d6d31c5707202b870d93ca1b6c8c</string>
                    <key>path</key>
                    <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.hjuutilainen-recipes/AgileBits/1Password.munki.recipe</string>
                    <key>sha256_hash</key>
                    <string>d3d86d8533c0fa1bf34a8c10f041313d0d2ef5225cb791e17328b3227702f3ff</string>
                </dict>
            </dict>
        </dict>
    </dict>
</plist>
