<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Identifier</key>
        <string>local.munki.Slack</string>
        <key>Input</key>
        <dict>
            <key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
            <false />
            <key>DISPLAY_NAME</key>
            <string>Slack</string>
            <key>DOWNLOAD_URL</key>
            <string>https://slack.com/ssb/download-osx</string>
            <key>MUNKI_CATEGORY</key>
            <string>Communications</string>
            <key>MUNKI_DESCRIPTION</key>
            <string>Slack is a platform for team communication: everything in one place, instantly searchable, available wherever you go.</string>
            <key>MUNKI_DEVELOPER</key>
            <string>Slack</string>
            <key>MUNKI_ICON</key>
            <string></string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>%NAME%</string>
            <key>NAME</key>
            <string>Slack</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>test</string>
                    <string>autopkg</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>%MUNKI_DESCRIPTION%</string>
                <key>developer</key>
                <string>%MUNKI_DEVELOPER%</string>
                <key>display_name</key>
                <string>%DISPLAY_NAME%</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true />
                <key>unattended_uninstall</key>
                <true />
            </dict>
        </dict>
        <key>ParentRecipe</key>
        <string>com.github.killahquam.munki.slack</string>
        <key>ParentRecipeTrustInfo</key>
        <dict>
            <key>non_core_processors</key>
            <dict />
            <key>parent_recipes</key>
            <dict>
                <key>com.github.killahquam.download.slack</key>
                <dict>
                    <key>git_hash</key>
                    <string>40ad9bb8cfd94df951bb24f6418ad158a2b1c9e1</string>
                    <key>path</key>
                    <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.killahquam-recipes/Slack/Slack.download.recipe</string>
                    <key>sha256_hash</key>
                    <string>22b579a5f12fb18798a303af72facd23beca0c94cc30757aafbc0776c9085b25</string>
                </dict>
                <key>com.github.killahquam.munki.slack</key>
                <dict>
                    <key>git_hash</key>
                    <string>4498bc796d2a730236fee65af03ab6eca8ebe140</string>
                    <key>path</key>
                    <string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.killahquam-recipes/Slack/Slack.munki.recipe</string>
                    <key>sha256_hash</key>
                    <string>92700fc3d44b37f2017bfe6e32c5634d9c681bc5ed84dfa329fa5e993624baf2</string>
                </dict>
            </dict>
        </dict>
    </dict>
</plist>